// Автоматичне приховування банера з підказкою

import { refs } from './js/refs';

// Контекст:
// На сторінці після завантаження з’являється підказка для користувача. Через кілька секунд її потрібно автоматично прибрати.

// Базовий HTML:

// Розширене ТЗ:
// · Після завантаження сторінки потрібно запустити setTimeout на 3000 мс.
// · Через 3000 мс елемент .hint-banner потрібно приховати.
// · id таймера потрібно зберегти в окремій змінній.
// · До завершення таймера банер має залишатися видимим.
// · Логіка повинна працювати без додаткових дій користувача

document.addEventListener('DOMContentLoaded', () => {
  setTimeout(() => {
    refs.hintBanner.classList.add('hidden');
  }, 3000);
});
